Repository: fnig2rm632/ShessBord
Catalog: ShessBord/Resources/Strings.*.resx
Languages: ru_ru

# SingUpButton
source: New? Sing up - and start playing chess!
ru_ru: Новый? Регистрация - начни играть!

# WatermarkLogin
source: Username, Phone , or Email
ru_ru: Логин, Телефон или Email

# WatermarkPassword
source: Password
ru_ru: Пароль

source: Forgot password?
ru_ru: Забыл телефон?

source: Log In
ru_ru: Вход

source: Language
ru_ru: Язык

# SingUpButtonAndroid
source: Registration
ru_ru: Регистрация

source: Submit
ru_ru: Отправить

source: Play
ru_ru: Играть

source: Friend
ru_ru: Друзья

source: About us
ru_ru: О нас

source: Settings
ru_ru: Настройки

source: Roll up
ru_ru: Свернуть

# Play10
source: Playing ~ 10 min.
ru_ru: Играть ~ 10 мин.

# Play5
source: Playing ~ 5 min.
ru_ru: Играть ~ 5 мин.

source: Play with friends
ru_ru: Играть c друзьями

source: New game
ru_ru: Новая игра

# Statistics
source: Statistic
ru_ru: Cтатистика

source: Parties
ru_ru: Партии

source: Bullet
ru_ru: Пуля

source: Rapid
ru_ru: Рапид

source: Blitz
ru_ru: Блиц

source: Wins
ru_ru: Победы

source: Archive of parties
ru_ru: Архив партий

source: View
ru_ru: Вид

source: Time
ru_ru: Время

source: Opponent
ru_ru: Противник

source: Result
ru_ru: Результат

source: Moves
ru_ru: Ходы

source: Data
ru_ru: Дата

source: Board size
ru_ru: Размер доски

source: Time control
ru_ru: Контроль времени

# Application1
source: Hi! My name is Artem Gamov, and this is my project — a Go application on Avalonia UI.
ru_ru: Привет! Меня зовут Гамов Артём, и это мой проект — Go-приложение на Avalonia UI.

source: What this?
ru_ru: Что это?

# Application2
source: The classic board game Go (also known as Weizi) with a simple and user-friendly interface.
ru_ru: Классическая настольная игра Go (также известная как "Вейци") с простым и удобным интерфейсом.

# Application4
source: Suitable for both beginners and experienced players.
ru_ru: Подходит как для новичков, так и для опытных игроков.

# Application3
source: It is written in C# using the Avalonia UI framework for cross-platform work (Windows, Linux, Android).
ru_ru: Написана на C# с использованием фреймворка Avalonia UI для кроссплатформенной работы (Windows, Linux, macOS).

source: Why Go?
ru_ru: Почему Go?

# Application5
source: Go is one of the oldest strategy games, combining simple rules with deep tactics. My goal is to make it available in digital format while preserving the elegance and atmosphere.
ru_ru: Go — одна из древнейших стратегических игр, сочетающая простые правила с глубокой тактикой. Моя цель — сделать её доступной в цифровом формате, сохранив элегантность и атмосферу.

source: Technologies
ru_ru: Технологии

source: Contacts
ru_ru: Контакты

# Application6
source: Avalonia UI is for beautiful and responsive interfaces.
ru_ru: Avalonia UI — для красивых и отзывчивых интерфейсов.

# Application7
source: ReactiveUI is for clean and flexible code.
ru_ru: ReactiveUI — для чистого и гибкого кода.

# Application8
source: .NET is the foundation for reliability and performance.
ru_ru: .NET — как основа надежности и производительности.

# Application9
source: Do you want to suggest an idea or report a bug? Write:
ru_ru: Хотите предложить идею или сообщить об ошибке? Пишите:

# TextSearchByName
source: Search by name or by username
ru_ru: Поиск по имени или по имени пользователя

source: Invalid password or Email address
ru_ru: Неверный пароль или Email

source: Registration
ru_ru: Регистарация

source: Register
ru_ru: Зарегистрироваться

source: Name
ru_ru: Имя

# IsValid
source: Valid
ru_ru: Подходит

# PasswordCannotContainSpaces
source: Password сannot сontain spaces
ru_ru: Пароль не может содержатьпробелы

source: Password must contain special char
ru_ru: Пароль должен содержать специальные символы

source: Password must contain upper case
ru_ru: Пароль должен содержать Заглыные буквы

source: Password must contain lowercase
ru_ru: Пароль должен содержать строчные буквы

source: Password must be at least 8 characters
ru_ru: Пароль должен содержать 8 символов

# PasswordCannotBeEmpty
source: Password сannot be empty
ru_ru: Пароль не может быть пустым

source: Do you already have an account?
ru_ru: У вас уже есть аккаунт?

source: Password must contain number
ru_ru: Пароль должен содержать цыфры

source: Email cannot be empty
ru_ru: Email не может быть пустым

source: Name cannot be empty
ru_ru: Имя не может быть пустым

source: Is not an Email
ru_ru: Не является Email

source: Email must not contain special characters
ru_ru: Email не может содержать странных символов

source: Name must not contain special characters
ru_ru: Имя не может содержать странных символов

source: Password must not contain special characters
ru_ru: Пароль не может содержать странных символов

source: Player white
ru_ru: Игрок белых

source: Player black
ru_ru: Игрок черных

source: Size board
ru_ru: Размер доски
